{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Домашнее задание №4\n",
    "\n",
    "За разные задачи можно получить разное число баллов. Если не указано обратное, задача весит 1 балл. Максимум за ДЗ можно набрать 6 баллов. Вы можете решить больше задач, чем требуется, чтобы потренироваться.\n",
    "\n",
    "*Тестов для предварительной проверки в этом домашнем задании нет, но при этом важно помнить, что нерабочий код (который не запускается из-за опечаток ошибок синтаксиса, неверных типов объектов и прочее) не засчитывается.*\n",
    "\n",
    "**Внимание!** Если в какой-то момент забыть ввести входные данные и перейти на следующую ячейку, есть риск, что Notebook перестанет откликаться. В этом случае надо перезапустить ядро: *Kernel → Restart*. При этом потеряются все значения переменных, но сам код останется."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача 1\n",
    "\n",
    "В переменной `user` сохранено имя пользователя (создайте переменную и сохраните любое). \n",
    "\n",
    "Напишите программу, которая запрашивает имя пользователя с клавиатуры и сравнивает его со значением в `user`. \n",
    "\n",
    "* Если они совпадают, то на экран выводится сообщение \"Welcome back! Python missed you!\".\n",
    "\n",
    "* Если они не совпадают, то на экран выводится сообщение \"Sorry, Python is busy and not available now\"."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача 2\n",
    "\n",
    "В списке `grades` сохранены оценки студентов за контрольную работу в 10-балльной шкале. \n",
    "\n",
    "    grades = [6, 7, 4, 3, 5, 10, 9, 8]\n",
    "    \n",
    "Напишите программу, которая перебирает все оценки в списке и на каждую оценку выводит текстовый комментарий (\"Отлично\", \"Хорошо\", \"Удовлетворительно\", \"Плохо\") и оценку в 5-ной шкале.\n",
    "\n",
    "*Пример комментария (к оценке 7):*\n",
    "\n",
    "    Хорошо, 4\n",
    "\n",
    "*Пример комментария (к оценке 3):*\n",
    "\n",
    "    Плохо, 2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача 3\n",
    "\n",
    "В списке `marks` сохранены пары имя-оценка в 5-балльной шкале:\n",
    "\n",
    "    marks = [(\"Alicia\", 2), (\"Bill\", 5), (\"Charlie\", 5), \n",
    "            (\"Fred\", 4), (\"George\", 4), (\"Lily\", 3), (\"Susan\", 3)]\n",
    "\n",
    "Напишите программу, которая сохраняет *имена* студентов, получивших хорошие и отличные оценки, в список `good`, а получивших удовлетворительные и плохие оценки – в список `bad`.\n",
    "\n",
    "**Подсказка:**\n",
    "\n",
    "Один элемент списка – кортеж из двух элементов. Запустите следующий код и подумайте, как с таким списком можно работать:\n",
    "\n",
    "    for pair in marks:\n",
    "        print(pair[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача 4\n",
    "\n",
    "Напишите функцию `convert()`, которая принимает на вход целое число – рост человека в сантиметрах, а возвращает дробное число – рост человека в метрах. Функция не должна ничего печатать, то есть выводить на экран."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача 5\n",
    "\n",
    "Напишите функцию `money()`, которая принимает на вход сумму в рублях и курс евро и:\n",
    "\n",
    "* возвращает сумму в евро, округленную до второго знака после запятой;\n",
    "* выводит на экран сообщение вида \"Сумма в рублях: [n1], сумма в евро: [n2]\".\n",
    "\n",
    "**Пример:**\n",
    "\n",
    "*Применение:*\n",
    "\n",
    "    money(1000, 70.77)\n",
    "\n",
    "*Результат:*\n",
    "\n",
    "    Сумма в рублях: 1000, сумма в евро: 14.13\n",
    "    14.13"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача 6\n",
    "\n",
    "Напишите функцию `dummy()`, которая принимает на вход список значений индекса Freedom House `f` и возвращает список из 0 и 1, где 1 соответствует свободным странам (статус *Free*, значения индекса от 1.0 до 2.5 включительно). Функция не должна ничего печатать, то есть выводить на экран.\n",
    "\n",
    "**Примеры работы функции:**\n",
    "\n",
    "*Применение:*\n",
    "\n",
    "    dummy([2.5, 3.0, 2.7, 3.6, 4.8, 6.5, 1.0, 1.5, 7.0])\n",
    "\n",
    "*Результат:*\n",
    "\n",
    "    [1, 0, 0, 0, 0, 0, 1, 1, 0]\n",
    "\n",
    "*Применение:*\n",
    "\n",
    "    dummy([3.5, 3.0, 2.7, 3.6])\n",
    "\n",
    "*Результат:*\n",
    "\n",
    "    [0, 0, 0, 0]"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
